---
kind: other
id: Methods.T:Autodesk.Revit.DB.AdaptiveComponentInstanceUtils
source: html/331a207f-ac55-a71e-b1dd-32f016b61741.htm
---
# AdaptiveComponentInstanceUtils Methods

Creates a FamilyInstance of Adaptive Component Family.